
/* придумать, как шифровать пароль! */

INSERT INTO user (id, login, password, role, surname, name, patronymic)
VALUES
(1, "1823243", "11111", 0, "Алексин", "Александр", "Сергеевич"),
(2, "1823350", "11111", 0, "Атаев", "Арслан", "Батырович"),
(3, "1823073", "11111", 0, "Белкина", "Дарья", "Александровна"),
(4, "1823177", "11111", 0, "Беркович", "Павел", "Александрович"),
(5, "1823104", "11111", 0, "Бородако", "Валерия", "Андреевна"),
(6, "1823152", "11111", 0, "Бочков", "Илья", "Витальевич"),
(7, "1839019", "11111", 0, "Волович", "Артём", "В"),
(8, "1823244", "11111", 0, "Гетьман", "Антон", "Сергеевич"),
(9, "1823153", "11111", 0, "Дасько", "Фёдор", "Борисович"),
(10, "1823399", "11111", 0, "Дорофеев", "Герман", "Сергеевич"),
(11, "1823211", "11111", 0, "Заломов", "Данил", "Павлович"),
(12, "1823120", "11111", 0, "Калинчук", "Мария", "Валерьевна"),
(13, "1823082", "11111", 0, "Лазарь", "Никита", "Андреевич"),
(14, "1823385", "11111", 0, "Невзоров", "Алексей", "Сергеевич"),
(15, "1823197", "11111", 0, "Нестёркина", "Елена", "Александровна"),
(16, "1823403", "11111", 0, "Петровский", "Станислав", "Александрович"),
(17, "1823155", "11111", 0, "Попова", "Анна", "Юрьевна"),
(18, "1823150", "11111", 0, "Рахлина", "Анна", "Евгеньевна"),
(19, "1823265", "11111", 0, "Сафиуллин", "Тулеубай", "Тулеубаевич"),
(20, "1823378", "11111", 0, "Сенькевич", "Николай", "Игоревич"),
(21, "1639033", "11111", 0, "Станевко", "Александр", "Сергеевич"),
(22, "1823079", "11111", 0, "Стащенко", "Ксения", "Алексеевна"),
(23, "1823139", "11111", 0, "Трифонова", "Надежда", "Владимировна"),
(24, "1823397", "11111", 0, "Четвергов", "Матвей", "Юрьевич"),
(25, "1823380", "11111", 0, "Чопчиц", "Павел", "Степанович"),
(26, "1823127", "11111", 0, "Шиляев", "Иван", "Владимирович"),
(27, "1823191", "11111", 0, "Шутов", "Леонид", "Иванович");