
/* придумать, как шифровать пароль! */

INSERT INTO user (id, login, password, role, surname, name, patronymic)
VALUES
(1, "1823243", "11111", 0, "Алексин", "Александр", "Сергеевич"),
(2, "1823350", "11111", 0, "Атаев", "Арслан", "Батырович"),
(3, "1823073", "11111", 0, "Белкина", "Дарья", "Александровна"),
(4, "1823177", "11111", 0, "Беркович", "Павел", "Александрович"),
(5, "1823104", "11111", 0, "Бородако", "Валерия", "Андреевна"),
(6, "1823152", "11111", 0, "Бочков", "Илья", "Витальевич"),
(7, "1839019", "11111", 0, "Волович", "Артём", "В"),
(8, "1823244", "11111", 0, "Гетьман", "Антон", "Сергеевич"),
(9, "1823153", "11111", 0, "Дасько", "Фёдор", "Борисович"),
(10, "1823399", "11111", 0, "Дорофеев", "Герман", "Сергеевич"),
(11, "1823211", "11111", 0, "Заломов", "Данил", "Павлович"),
(12, "1823120", "11111", 0, "Калинчук", "Мария", "Валерьевна"),
(13, "1823082", "11111", 0, "Лазарь", "Никита", "Андреевич"),
(14, "1823385", "11111", 0, "Невзоров", "Алексей", "Сергеевич"),
(15, "1823197", "11111", 0, "Нестёркина", "Елена", "Александровна"),
(16, "1823403", "11111", 0, "Петровский", "Станислав", "Александрович"),
(17, "1823155", "11111", 0, "Попова", "Анна", "Юрьевна"),
(18, "1823150", "11111", 0, "Рахлина", "Анна", "Евгеньевна"),
(19, "1823265", "11111", 0, "Сафиуллин", "Тулеубай", "Тулеубаевич"),
(20, "1823378", "11111", 0, "Сенькевич", "Николай", "Игоревич"),
(21, "1639033", "11111", 0, "Станевко", "Александр", "Сергеевич"),
(22, "1823079", "11111", 0, "Стащенко", "Ксения", "Алексеевна"),
(23, "1823139", "11111", 0, "Трифонова", "Надежда", "Владимировна"),
(24, "1823397", "11111", 0, "Четвергов", "Матвей", "Юрьевич"),
(25, "1823380", "11111", 0, "Чопчиц", "Павел", "Степанович"),
(26, "1823127", "11111", 0, "Шиляев", "Иван", "Владимирович"),
(27, "1823191", "11111", 0, "Шутов", "Леонид", "Иванович"),

(28, "tutor1", "11111", 2, "Деменчук", "Александр", "Константинович");

INSERT INTO faculty (name)
VALUES
("Факультет прикладной математики и информатики"),
("Механико-математический факультет");

INSERT INTO ugroup (group_number, course_number, faculty_id)
VALUES
(9, 2, 1);

INSERT INTO subgroup (subgroup_number, group_id)
VALUES
('a', 1),
('b', 1);

INSERT INTO student
VALUES
(1, 1, 1),
(2, 1, 2),
(3, 1, 3),
(4, 1, 4),
(5, 1, 5),
(6, 1, 6),
(7, 1, 7),
(8, 1, 8),
(9, 1, 9),
(10, 1, 10),
(11, 1, 11),
(12, 1, 12),
(13, 1, 13),
(14, 2, 14),
(15, 2, 15),
(16, 2, 16),
(17, 2, 17),
(18, 2, 18),
(19, 2, 19),
(20, 2, 20),
(21, 2, 21),
(22, 2, 22),
(23, 2, 23),
(24, 2, 24),
(25, 2, 25),
(26, 2, 26),
(27, 2, 27);

INSERT INTO leader
VALUES
(1, 23);

INSERT INTO classroom
VALUES
(1, 607, 100, 1, 1),
(2, 256, 30, 0, 0),
(3, 248, 30, 0, 0),
(4, 505, 15, 0, 1),
(5, 605, 100, 1, 1),
(6, 600, 30, 0, 0),  /* 600б */
(7, 601, 30, 0, 0),  /* 600в */
(8, 604, 30, 0, 1),
(9, 506, 30, 0, 1),
(10, 234, 30, 0, 0);

INSERT INTO subject
VALUES
(1, "Математический анализ"),
(2, "Дифференциальные уравнения"),
(3, "Теория вероятностей и математическая статистика"),
(4, "Учебная практика"),
(5, "Алгоритмы и структуры данных"),
(6, "Физическая культура"),
(7, "Методы численного анализа"),
(8, "Политология"),
(9, "Операционные системы");

INSERT INTO tutor (id, position, degree, user_id)
VALUES
(1, "доцент кафедры высшей математики", "кандидат физико-математических наук", 28);

INSERT INTO timetable (id, day, pair_number, subject_id, type, classroom_id, tutor_id)
VALUES
(1, 0, 3, 2, 1, 2, 1),
(2, 0, 4, 2, 0, 1, 1);

INSERT INTO timetable_group (timetable_id, subgroup_id)
VALUES
(1, 1),
(1, 2),
(2, 1),
(2, 2);